In [1]:
import pandas as pd
import numpy as np
import json

In [2]:
dados = pd.read_json('desafio2.json')
dados

                                             pessoas
0  {'nome': 'João', 'idade': '25', 'endereco': {'...
1  {'nome': 'Maria', 'idade': 30, 'endereco': {'r...

In [3]:
with open('desafio2.json', 'r') as j:
    dados_brutos = json.load(j)
dados_brutos

{'pessoas': [{'nome': 'João',
   'idade': '25',
   'endereco': {'rua': 'Rua A', 'numero': 123, 'cidade': 'São Paulo'},
   'telefones': ['11 1111-1111', '11 2222-2222']},
  {'nome': 'Maria',
   'idade': 30,
   'endereco': {'rua': '', 'numero': 456, 'cidade': 'Rio de Janeiro'},
   'telefones': ['21 3333-3333']}]}

In [4]:
dados = pd.json_normalize(dados_brutos) # se tivesse utilizado pd.json_normalize(dados_brutos, record_path=['pessoas']) teria evistado as proximas 5 células de código.
dados

                                             pessoas
0  [{'nome': 'João', 'idade': '25', 'endereco': {...

In [5]:
dados['pessoas']

0    [{'nome': 'João', 'idade': '25', 'endereco': {...
Name: pessoas, dtype: object

In [6]:
dados = pd.json_normalize(dados['pessoas'])
dados

,0,1
0,"{'nome': 'João', 'idade': '25', 'telefones': [...","{'nome': 'Maria', 'idade': 30, 'telefones': ['..."

In [7]:
dados = pd.json_normalize(dados_brutos)
dados

                                             pessoas
0  [{'nome': 'João', 'idade': '25', 'endereco': {...

In [9]:
dados = dados.explode('pessoas')
dados

                                             pessoas
0  {'nome': 'João', 'idade': '25', 'endereco': {'...
0  {'nome': 'Maria', 'idade': 30, 'endereco': {'r...

In [10]:
dados = pd.json_normalize(dados['pessoas'])

In [11]:
dados

,nome,idade,telefones,endereco.rua,endereco.numero,endereco.cidade
0,João,25,"[11 1111-1111, 11 2222-2222]",Rua A,123,São Paulo
1,Maria,30,[21 3333-3333],,456,Rio de Janeiro

In [12]:
dados = dados.explode('telefones')
dados

    nome idade     telefones endereco.rua  endereco.numero endereco.cidade
0   João    25  11 1111-1111        Rua A              123       São Paulo
0   João    25  11 2222-2222        Rua A              123       São Paulo
1  Maria    30  21 3333-3333                           456  Rio de Janeiro

In [13]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0 to 1
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nome             3 non-null      object
 1   idade            3 non-null      object
 2   telefones        3 non-null      object
 3   endereco.rua     3 non-null      object
 4   endereco.numero  3 non-null      int64
 5   endereco.cidade  3 non-null      object
dtypes: int64(1), object(5)
memory usage: 168.0+ bytes

In [14]:
dados['idade'] = dados['idade'].astype(np.int64)

In [15]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0 to 1
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nome             3 non-null      object
 1   idade            3 non-null      int64
 2   telefones        3 non-null      object
 3   endereco.rua     3 non-null      object
 4   endereco.numero  3 non-null      int64
 5   endereco.cidade  3 non-null      object
dtypes: int64(2), object(4)
memory usage: 168.0+ bytes

In [16]:
dados

    nome  idade     telefones endereco.rua  endereco.numero endereco.cidade
0   João     25  11 1111-1111        Rua A              123       São Paulo
0   João     25  11 2222-2222        Rua A              123       São Paulo
1  Maria     30  21 3333-3333                           456  Rio de Janeiro

In [17]:
dados_sem_vazio = dados.query("`endereco.rua` != ''") # poderia ser tmb dados[dados['endereco.rua'] != '']
dados_sem_vazio

   nome  idade     telefones endereco.rua  endereco.numero endereco.cidade
0  João     25  11 1111-1111        Rua A              123       São Paulo
0  João     25  11 2222-2222        Rua A              123       São Paulo